[
  {
    "name": "Compass Rose",
    "type": "Ring",
    "rarity": "Rare",
    "source": "Custom",
    "entries": [
      "This ring has 10 charges and regains 1d10 expended charges daily at dawn. As an action, you can expend 1 or more charges to cast one of the following spells (save DC 16) from the ring: {@spell find the path} (8 charges), {@spell locate animals or plants} (2 charges), {@spell locate creature} (5 charges), {@spell locate object} (4 charges). If you are on your home plane, you can also expend 1 charge to find the direction home. You can't move this round if you expend any of the ring's charges."
    ],
    "attachedSpells": [
      "find the path",
      "locate animals or plants",
      "locate creature",
      "locate object"
    ]
  },
  {
    "name": "Traveler's Pledge",
    "type": "Wondrous item",
    "rarity": "Rare",
    "source": "Custom",
    "entries": [
      "This amulet is shaped like a waving hand. It has 10 charges and regains 1d10 expended charges daily at dawn. You can use an action to expend 1 or more charges, resulting in one of the effects shown in the Traveler's Pledge Effects Table.",
      {
        "type": "table",
        "caption": "Traveler's Pledge Effects",
        "colLabels": ["Charges", "Effect"],
        "rows": [
          [
            "1",
            "Gain advantage on an ability check to help you complete your journey (for example, to forage, find a safe place to camp, asking for the cooperation of other travelers), but not to help you find your destination."
          ],
          [
            "2",
            "You speak the item's command word to summon a {@creature mule} and cart for up to 8 hours. The mule can't attack and moves to protect itself as well as the cart in combat. Both the cart and mule are dismissed if you speak the command word again, move 100 feet away from them, or if the mule drops to 0 hit points."
          ],
          ["4", "Cast {@spell Leomund's Tiny Hut} from the amulet."],
          [
            "8",
            "Cast {@spell Mordenkainen's Private Sanctum} from the amulet as a 4th-level spell."
          ]
        ]
      }
    ],
    "attachedSpells": ["Leomund's tiny hut", "Mordenkainen's private sanctum"]
  },
  {
    "name": "Endless Walk",
    "type": "Wondrous item",
    "rarity": "Artifact",
    "source": "Custom",
    "reqAttune": true,
    "entries": [
      "You may attune to this item if you are wearing the {@item Traveler's Pledge} and the {@item Compass Rose}. The items now share a pool of 20 charges and regain 2d10 expended charges daily at dawn.",
      {
        "type": "entries",
        "name": "Blessings for the Road",
        "entries": [
          "When you roll 1 or 2 on a hit die to regain hit points while you are away from home, you can reroll the die. Additionally, you always know which general direction leads home if it's on the same plane. If it isn't, you know the direction to the nearest portal to your plane."
        ]
      },
      {
        "type": "entries",
        "name": "Random Properties",
        "entries": [
          "The {@item Endless Walk} has the following properties, determined by rolling on the tables in the {@italic Artifacts} section in chapter 7 of the {@italic Dungeon Master's Guide}:",
          {
            "type": "list",
            "items": ["3 minor beneficial properties", "1 minor detrimental property"]
          }
        ]
      },
      {
        "name": "Spells",
        "type": "entries",
        "entries": [
          "You can cast {@spell divination} and {@spell Mordenkainen's Magnificent Mansion} once per day each, requiring no material components."
        ]
      },
      {
        "name": "The Traveler's Pledge",
        "type": "entries",
        "entries": [
          "While you are moving, you can use your bonus action to give yourself resistance to a single damage type of your choice or cast {@spell stoneskin} on yourself. This effect ends if you do not use your full movement in a turn, stop moving for any reason, or take the Hide action."
        ]
      },
      {
        "name": "The Compass Rose",
        "type": "entries",
        "entries": [
          "If you do not move this round, your have advantage on attack rolls and creatures have disadvantage on saving throws against spells you cast. Your attacks and damaging abilities deal an extra 2d8 damage."
        ]
      }
    ],
    "attachedSpells": ["divination", "Mordenkainen's magnificent mansion"]
  }
]
